app/controllers/events_controller.rb

INSERT INTO "events" ("name", "place", "date", "time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.user = @current_user

    if @event.save

UPDATE "events" SET "name" = $1, "place" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["name", "Robocop"], ["place", "Library"], ["updated_at", "2022-12-25 20:34:59.002724"], ["id", 1]]
---
  def update
    if @event.update(event_params)