app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    @student.user = @current_user
    @student.event = @event


    if @student.save
---
INSERT INTO "students" ("name", "address", "contact", "user_id", "event_id", "volunteer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @student.update(student_params)
---
UPDATE "students" SET "name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["name", "Dom Guess"], ["updated_at", "2022-09-09 13:15:45.354559"], ["id", 2]]