app/controllers/students_controller.rb

SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_volunteer
      @volunteer = Volunteer.find(params[:volunteer_id])