app/controllers/users_controller.rb

INSERT INTO "users" ("username", "name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "nlfinezt"], ["name", "dom guess"], ["email", "github.com"], ["password", "[FILTERED]"], ["created_at", "2022-09-09 13:35:04.082017"], ["updated_at", "2022-09-09 13:35:04.082017"]]
---
  def create
    @user = User.new(user_params)

    if @user.save