app/controllers/volunteers_controller.rb

  def index
    @volunteers = Volunteer.all
---
SELECT "volunteers".* FROM "volunteers"

  def create
    @volunteer = Volunteer.new(volunteer_params)

    if @volunteer.save
---
INSERT INTO "volunteers" ("First_Name", "Last_Name", "Email", "Message", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @volunteer.update(volunteer_params)
---
UPDATE "volunteers" SET "First_Name" = $1, "updated_at" = $2 WHERE "volunteers"."id" = $3  [["First_Name", "for"], ["updated_at", "2022-09-09 13:22:48.822092"], ["id", 3]]

  def destroy
    @volunteer.destroy
---
DELETE FROM "volunteers" WHERE "volunteers"."id" = $1  [["id", 3]]

    def set_volunteer
      @volunteer = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]